Revit 2024 API
ExternalResourceBrowserData Constructor
 Constructs a new ExternalResourceBrowserData using the given document(optional), server id, folder path and match options.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2015
Syntax
C#
public ExternalResourceBrowserData(
	Document document,
	Guid serverId,
	string folderPath,
	ExternalResourceMatchOptions matchOptions
)
Visual Basic
Public Sub New ( _
	document As Document, _
	serverId As Guid, _
	folderPath As String, _
	matchOptions As ExternalResourceMatchOptions _
)
Visual C++
public:
ExternalResourceBrowserData(
	Document^ document,
	Guid serverId,
	String^ folderPath,
	ExternalResourceMatchOptions^ matchOptions
)
Parameters
document
Type: Autodesk.Revit.DB.Document
 The document for which the external resource browser data is requested. The document can be null, if so, the getCallingDocumentModelPath() will not return ModelPath.
serverId
Type: System.Guid
 The id of IExternalResourceServer which handles the external resource browsing and loading.
folderPath
Type: System.String
 The folder path to which the external resources and subfolders belong.
The folder separator should always be "/" and "/" always represents the root folder for the server.
The interpretation of what a folder represents is up to the server. For example, the folder "/English/Keynote" might be a physical folder on a disk, or a table or key in a database.
matchOptions
Type: Autodesk.Revit.DB.ExternalResourceMatchOptions
 The options to match the external resources and folders.
Generally, the returned resources should match the options, otherwise the resource may be regarded as invalid which may not be available in browser dialogs.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
See Also
ExternalResourceBrowserData Class
Autodesk.Revit.DB Namespace